SMEO tst/integrator/SMEO/templates/getSMEOAssessmentDataFromICMore

<soapenv:Envelope xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/07/secext" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:acc="urn:crmondemand/ws/ecbs/account/" xmlns:quer="urn:/crmondemand/xml/Account/Query">
   <soapenv:Header>
      <wsse:Security soapenv:mustUnderstand="1">
         <wsse:UsernameToken>
            <wsse:Username>${headers.soapConnectorProperties.icMoreUsername}</wsse:Username>
            <wsse:Password Type="wsse:PasswordText">${headers.soapConnectorProperties.icMorePassword}</wsse:Password>
         </wsse:UsernameToken>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <acc:AccountQueryPage_Input>
         <quer:ListOfAccount pagesize="50" startrownum="0" recordcountneeded="true">
            <!--Optional:-->
            <quer:Account>
               <!--You may enter the following 1038 items in any order-->
               <quer:ModifiedDate/>
               <!--Account id-->
               <quer:Id>='${body.variables.ICMoreAccountID}'</quer:Id>
               <!-- Requested Credit Line Lease -->
               <quer:CustomCurrency4/>
               <!-- Max Rentals -->
               <quer:CustomNumber6/>
               <!-- SMEO Process instance id -->
               <quer:CustomText56/>
            </quer:Account>
         </quer:ListOfAccount>
      </acc:AccountQueryPage_Input>
   </soapenv:Body>
</soapenv:Envelope>